Section 01

In [36]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.head(5)

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2024-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2024-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2024-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2024-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2024-03-07  1338.0

In [37]:
df.shape

(120, 10)

In [38]:
cond = df['f5']==0
df[~cond].shape[0]

102

In [39]:
df['views'] = df['views'].fillna(df['views'].min())
df['views'].isnull().sum()

np.int64(0)

In [44]:
df['views'].median()

5924.0

Section 02

In [55]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

In [56]:
date = df['subscribed'].mode()[0]
date

'2025-02-17'

In [59]:
pd.to_datetime(date).strftime('%d')

'17'

Section 03

In [68]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.dropna(inplace=True)
df['new'] = df['views'] / df['f1']
df.sort_values('new', ascending=False).head()

,id,age,city,f1,f2,f3,f4,f5,subscribed,views,new
115,id114,22.0,대구,23.0,0,gold,INTP,0.000000,2025-02-17,9747.0,423.782609
83,id83,73.0,경기,50.0,1,vip,ENTP,80.138280,2024-09-26,19139.0,382.780000
5,id06,22.0,서울,57.0,0,vip,INTP,20.129444,2024-09-12,21550.0,378.070175
105,id104,21.0,서울,13.0,0,silver,ESFJ,0.000000,2025-02-17,4556.0,350.461538
106,id105,21.0,경기,24.0,0,gold,ESFJ,0.000000,2025-02-17,7654.0,318.916667

Section 04

In [125]:
df = pd.read_csv("type1_data1.csv")
df['views'] = df['views'].fillna(0)

In [126]:
df.sort_values('views', ascending=False, inplace=True)
min_view = df.iloc[:10, :]['views'].min()

In [132]:
df.iloc[:10, -1] = min_view
df.head(11)

        id   age city    f1  f2      f3    f4         f5  subscribed   views
5     id06  22.0   서울  57.0   0     vip  INTP  20.129444  2024-09-12  9877.0
56    id56  59.0   대구   NaN   1     vip  ESTJ  73.586397  2024-04-05  9877.0
83    id83  73.0   경기  50.0   1     vip  ENTP  80.138280  2024-09-26  9877.0
32    id32  25.0   부산  64.0   0     vip  ISFJ  13.049921  2024-05-24  9877.0
100  id100  47.0   경기  53.0   0     vip  ESFP  33.308999  2024-02-21  9877.0
10   id100  47.0   경기  53.0   0     vip  ESFP  33.308999  2024-02-21  9877.0
104  id103  21.0   부산  53.0   0     vip  ISFP   0.000000  2025-02-17  9877.0
114  id113  22.0   경기  34.0   2  silver  ENTP   0.000000  2025-02-17  9877.0
9     id10  95.0   서울  74.0   1    gold  ISFP  98.429899  2024-04-03  9877.0
113  id112  22.0   서울  45.0   2     vip  ENTP   0.000000  2025-02-17  9877.0
115  id114  22.0   대구  23.0   0    gold  INTP   0.000000  2025-02-17  9747.0

In [133]:
df['views'].sum()

np.float64(652812.0)

Section 05

In [138]:
df = pd.read_csv("type1_data1.csv")
#df.head(5)

df = df[df['f4'].str.contains('FJ')==True]
round(df['f2'].mean(),2)

np.float64(0.61)

Section 06

In [149]:
df = pd.read_csv("type1_data1.csv")
cond = df['f3'] == 'gold'
cond2 = df['f2'] == 2

df2 = df[cond & cond2]
round(df2['f1'].var(),2)

235.43

Section 07

In [ ]:
import pandas as pd

df = pd.read_csv("type1_data1.csv")

df['age'] = df['age']+1

cond1 = df['age']>=20
cond2 = df['age']<30
cond3 = df['age']>=30
cond4 = df['age']<40

age_20s = df[cond1 & cond2]
age_30s = df[cond3 & cond4]

a = age_20s['views'].mean()
b = age_30s['views'].mean()

round(abs(a-b),2)

np.float64(263.13)

Section 08

In [192]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df['subscribed'] = pd.to_datetime(df['subscribed'])
cond = (df['subscribed'].dt.year == 2024) & (df['subscribed'].dt.month == 2)

df = df[cond]
len(df[df['f3'] == 'gold'])

5

Section 09

In [195]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df = df[df['views']<=1000]
df['f4'].mode()[0]

'ISFJ'

Section 10

In [205]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.dropna(inplace=True)
df.groupby(['city']).mean(numeric_only=True)

            age         f1        f2         f5        views
city
경기    48.704000  61.360000  0.760000  52.106731  8127.880000
대구    49.773333  66.200000  0.666667  27.370166  6819.133333
부산    35.075000  65.875000  0.687500  38.638715  6945.437500
서울    38.000000  60.142857  0.785714  41.122705  7369.142857

Section 11

In [227]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")
df.dropna(inplace=True)
length = len(df)*0.7
df = df.iloc[:int(length)]

df['views'].quantile(0.75) - df['views'].quantile(0.25)

np.float64(2771.0)

Section 12

In [251]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.isnull().sum()
df = df.dropna(subset=['f1'])

df['f3'] = df['f3'].fillna(df['f3'].mode()[0])
df['f3'].isnull().sum()
len(df[df['f3'] == 'gold'])

63

Section 13

In [255]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df_null = df[df['f1'].isnull()==True]
df_null['age'].mean()

np.float64(53.596774193548384)

Section 14

In [263]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.drop_duplicates(inplace=True)
df['f3'].fillna(0, inplace=True)
dict = {'silver': 1, "gold": 2, "vip": 3}
df['f3'].replace(dict, inplace=True)

df['f3'].sum()

/var/folders/gx/_f61ngf91hq2y51c1jv2qkkr0000gn/T/ipykernel_75413/2029036434.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['f3'].fillna(0, inplace=True)
/var/folders/gx/_f61ngf91hq2y51c1jv2qkkr0000gn/T/ipykernel_75413/2029036434.py:7: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['f3'].replace(dict, inplace=True)

np.int64(167)

Section 15

In [288]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df2 = df.select_dtypes(exclude = 'object')
df2.fillna(0, inplace=True)

len(df[df2.sum(axis=1)>3000])

88

Section 16

In [296]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

q3 = df['views'].quantile(0.75)
q1 = df['views'].quantile(0.25)

IQR = q3 - q1

cond = q1 - IQR*1.5
cond2 = q3 + IQR*1.5

cond3 = (df['views'] < cond) | (df['views'] > cond2)

df[cond3]['views'].sum()

np.float64(77699.0)

Section 17

In [319]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

r1 = df['views'].std()
c1 = df['age']<=0
df = df[~c1]

a = df['age'] - df['age'].astype(int) == 0
df = df[a]

r2 = df['views'].std()

round(abs(r1 + r2),2)

8297.31

Section 18

In [349]:
import pandas as pd
df = pd.read_csv("type1_data2.csv", index_col = 'year')

mean_2001 = df.loc[2001].mean()
cond1 = df.loc[2001] > mean_2001
r1 = sum(cond1)

mean_2003 = df.loc[2003].mean()
cond2 = df.loc[2003] < mean_2003
r2 = sum(cond2)

r1+r2

202

Section 19

In [355]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.fillna(method='bfill', inplace=True)

pd.DataFrame(df.groupby(['city','f2'])['views'].sum())

/var/folders/gx/_f61ngf91hq2y51c1jv2qkkr0000gn/T/ipykernel_75413/2693853264.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill', inplace=True)

            views
city f2
경기   0   154066.0
     1    91442.0
     2    42709.0
대구   0   100421.0
     1    49536.0
     2    22624.0
부산   0    80460.0
     1    51624.0
     2    17771.0
서울   0    61447.0
     1    59111.0
     2    22405.0

In [358]:
df = df.groupby(['city','f2']).sum(numeric_only=True).reset_index()
df.sort_values('views', ascending=False)

   city  f2     age      f1           f5     views
0    경기   0  1192.9  1490.0  1425.236647  154066.0
3    대구   0   664.0   982.0   371.184620  100421.0
1    경기   1   997.0  1016.0   935.958628   91442.0
6    부산   0   525.0   691.0   395.272907   80460.0
9    서울   0   241.0   480.0   484.809540   61447.0
10   서울   1   433.3   687.0   506.371383   59111.0
7    부산   1   475.7   684.0   460.657406   51624.0
4    대구   1   393.6   471.0   404.779978   49536.0
2    경기   2   296.0   390.0   430.186433   42709.0
5    대구   2   185.0   321.0    79.667919   22624.0
11   서울   2   165.3   337.0   179.328213   22405.0
8    부산   2    38.5   189.0   101.195372   17771.0

Section 20

In [371]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.head()

df['subscribed'] = pd.to_datetime(df['subscribed'])
month = df['subscribed'].dt.month

df2 = df.groupby(month).sum(numeric_only=True)
df2.sort_values('views')

              age      f1  f2          f5     views
subscribed
11          186.0   181.0   1  278.410220   15857.0
12          365.0   373.0   2  515.672397   28658.0
6           481.8   244.0   6  387.206296   31295.0
3           326.3   457.0   8  352.729057   39031.0
1           441.8   608.0   1  487.453162   40013.0
4           307.0   268.0   4  312.187975   41307.0
10          483.0   437.0   6  595.737639   48705.0
8           338.5   119.0   6  520.223827   51048.0
9           473.6   356.0   3  379.121958   66340.0
7           534.0   399.0  10  630.370464   67677.0
5           809.6   822.0  10  855.287894  110786.0
2           860.7  1301.0  25  460.248156  165852.0

Section 21

In [386]:
df = pd.read_csv("delivery_time.csv")

df['주문시간'] = pd.to_datetime(df['주문시간'])
df['실제도착시간'] = pd.to_datetime(df['실제도착시간'])
df['예상도착시간'] = pd.to_datetime(df['예상도착시간'])

cond1 = df['예상도착시간'] < df['실제도착시간']
cond2 = df['거리'] >= 7

len(df[cond1 & cond2])

311

Section 22

In [400]:
df = pd.read_csv("delivery_time.csv")
df.head()

df['주문시간'] = pd.to_datetime(df['주문시간'])
df['실제도착시간'] = pd.to_datetime(df['실제도착시간'])
df['예상도착시간'] = pd.to_datetime(df['예상도착시간'])

time_diff = df['실제도착시간'] - df['주문시간'] 
df['min_diff'] = time_diff.dt.total_seconds()/60

df.groupby('앱종류')['min_diff'].mean()

앱종류
배고팡    61.818694
배달왕    63.517864
여기여    62.343110
Name: min_diff, dtype: float64

Section 23

In [407]:
df = pd.read_csv("delivery_time.csv")

df['주문시간'] = pd.to_datetime(df['주문시간'])
df['실제도착시간'] = pd.to_datetime(df['실제도착시간'])
df['예상도착시간'] = pd.to_datetime(df['예상도착시간'])

df['늦은 주문'] = df['실제도착시간']>df['예상도착시간']

df.groupby('결제종류')['늦은 주문'].mean()

결제종류
앱결제    0.556634
카드     0.489971
현금     0.488304
Name: 늦은 주문, dtype: float64

Section 24

In [462]:
df = pd.read_csv("delivery_time.csv")

df2 = df.groupby('user')['거리'].sum()
cond = df2 >= 50
df3 = df2[cond]

df4 = df[df['user'].isin(df3.index)]
df4['결제종류'].value_counts()

결제종류
카드     48
현금     45
앱결제    36
Name: count, dtype: int64

Section 25

In [490]:
df = pd.read_csv("delivery_time.csv")

df['주문시간'] = pd.to_datetime(df['주문시간'])
df['실제도착시간'] = pd.to_datetime(df['실제도착시간'])
df['예상도착시간'] = pd.to_datetime(df['예상도착시간'])

min_order = df.groupby('user')['주문시간'].min()
max_order = df.groupby('user')['주문시간'].max()
diff = (max_order - min_order).dt.days

cond = diff>0
df2 = diff[cond]
mean = df2.mean()

df2[df2>mean].count()

np.int64(146)

Section 26

In [498]:
df = pd.read_csv("delivery_time.csv")

df.head()

,주문시간,실제도착시간,예상도착시간,앱종류,거리,결제종류,user
0,2023-07-26 08:05:49,2023-07-26 09:14:06,2023-07-26 08:39:42,여기여,1.93,카드,user_275
1,2022-11-07 10:21:54,2022-11-07 10:44:04,2022-11-07 10:50:15,배고팡,5.19,카드,user_360
2,2023-04-18 05:00:57,2023-04-18 06:12:46,2023-04-18 05:32:53,배고팡,13.85,카드,user_36
3,2023-08-18 10:46:28,2023-08-18 11:16:25,2023-08-18 11:08:33,배고팡,10.90,앱결제,user_65
4,2023-08-11 09:58:27,2023-08-11 11:27:57,2023-08-11 10:51:57,여기여,14.96,카드,user_176

In [510]:
df['주문시간'] = pd.to_datetime(df['주문시간'])

df['year'] = df['주문시간'].dt.year
df['month'] = df['주문시간'].dt.month

df.groupby(['year', 'month'])['앱종류'].count()

# 2022 / 9
cond = (df['year']==2022) & (df['month']==9)
df2 = df[cond]
len(df2[(df2['앱종류']=='배고팡') & (df2['결제종류']=='앱결제')])/len(df2[df2['앱종류']=='배고팡'])

0.3125

Section 27

In [512]:
df = pd.read_csv("delivery_time.csv")

df.head()

,주문시간,실제도착시간,예상도착시간,앱종류,거리,결제종류,user
0,2023-07-26 08:05:49,2023-07-26 09:14:06,2023-07-26 08:39:42,여기여,1.93,카드,user_275
1,2022-11-07 10:21:54,2022-11-07 10:44:04,2022-11-07 10:50:15,배고팡,5.19,카드,user_360
2,2023-04-18 05:00:57,2023-04-18 06:12:46,2023-04-18 05:32:53,배고팡,13.85,카드,user_36
3,2023-08-18 10:46:28,2023-08-18 11:16:25,2023-08-18 11:08:33,배고팡,10.90,앱결제,user_65
4,2023-08-11 09:58:27,2023-08-11 11:27:57,2023-08-11 10:51:57,여기여,14.96,카드,user_176

In [526]:
df['주문시간'] = pd.to_datetime(df['주문시간'])
df['실제도착시간'] = pd.to_datetime(df['실제도착시간'])

time = df['주문시간'].dt.hour

cond = (time>=10) & (time<13)
df2 = df[cond]
df2

tl = df2['실제도착시간']-df2['주문시간']
th = tl.dt.total_seconds()/60/60
sp = df2['거리']/th

cond2 = sp >= 50
df2 = df2[cond2]
df2

,주문시간,실제도착시간,예상도착시간,앱종류,거리,결제종류,user
150,2023-02-07 12:47:12,2023-02-07 13:03:16,2023-02-07 13:30:52,배고팡,14.92,현금,user_311

Section 28

In [530]:
df = pd.read_csv("delivery_time.csv")

df.head()

df['주문시간'] = pd.to_datetime(df['주문시간'])
df['year'] = df['주문시간'].dt.year
df['month'] = df['주문시간'].dt.month

df.groupby(['year', 'month']).size()

year  month
2022  8        29
      9        95
      10       79
      11       81
      12       94
2023  1        82
      2        70
      3        73
      4        88
      5        83
      6        86
      7        83
      8        57
dtype: int64

Section 29

In [542]:
df = pd.read_csv("delivery_time.csv")

df.head()

def delivery_fee(distance):
    if distance < 5:
        return 2000
    elif distance < 10:
        return 4000
    elif distance < 15:
        return 6000
    else:
        return 8000 

df['cost'] = df['거리'].apply(delivery_fee)

df['주문시간'] = pd.to_datetime(df['주문시간'])
df['month'] = df['주문시간'].dt.month

df2 = df.groupby('month')['cost'].sum()
df2.sort_values(ascending=False)

month
6     448000
9     446000
8     444000
12    442000
7     434000
5     420000
4     410000
3     408000
10    388000
1     386000
11    384000
2     340000
Name: cost, dtype: int64

In [535]:
df.head()

,주문시간,실제도착시간,예상도착시간,앱종류,거리,결제종류,user
0,2023-07-26 08:05:49,2023-07-26 09:14:06,2023-07-26 08:39:42,여기여,1.93,카드,user_275
1,2022-11-07 10:21:54,2022-11-07 10:44:04,2022-11-07 10:50:15,배고팡,5.19,카드,user_360
2,2023-04-18 05:00:57,2023-04-18 06:12:46,2023-04-18 05:32:53,배고팡,13.85,카드,user_36
3,2023-08-18 10:46:28,2023-08-18 11:16:25,2023-08-18 11:08:33,배고팡,10.90,앱결제,user_65
4,2023-08-11 09:58:27,2023-08-11 11:27:57,2023-08-11 10:51:57,여기여,14.96,카드,user_176

Section 30

In [555]:
df = pd.read_csv("delivery_time.csv")

df.head()

df['주문시간'] = pd.to_datetime(df["주문시간"])
df['dow'] = df['주문시간'].dt.dayofweek
df.head()

df['주중'] = df['dow']<5
len(df[df['주중']==True]) - len(df[df['주중']==False])

412

Section 31

In [569]:
df = pd.read_csv("delivery_time.csv")

num = df['user'].str[5:]
num.astype(int).sum()

np.int64(261387)

Section 32

In [598]:
df = pd.read_csv("school_data.csv")
df.head()
df['total'] = df['수학'] + df['국어'] + df['영어']
df.head()

df.nlargest(10, 'total')['수학'].mean()

np.float64(81.5)

Section 33

In [583]:
df = pd.read_csv("school_data.csv")
df.head()

df = df.melt(['이름','수학교사','국어교사','영어교사'])
df2 = df.sort_values('value', ascending=True).head(25)
df2['value'].sum()

np.int64(420)

Section 34

In [623]:
df = pd.read_csv('school_data.csv')
df_sci = pd.read_csv('school_data_science.csv')

df_full = pd.concat([df, df_sci], axis=1)
df_full['avg'] = df_full[['수학','영어','국어','과학']].mean(axis=1)
len(df_full[df_full['avg']>=60])

9

Section 35

In [639]:
df = pd.read_csv('school_data.csv')
df_sci = pd.read_csv('school_data_social.csv')

df = df.merge(df_sci, on="이름")

cond = (df['영어교사']=='장선생') & (df['사회교사']=='오선생')
df[cond]['수학'].sum()

np.int64(602)

Section 36

In [655]:
df = pd.read_csv('sales.csv')
money = df.groupby('지역코드')['판매금액'].transform('mean')
df['판매금액'] = df['판매금액'].fillna(money)
df['지역 평균'] = money
df['차이'] = abs(df['판매금액'] - df['지역 평균'])

df.groupby('지역코드')['차이'].mean()

지역코드
101    120.0
102    140.0
103    260.0
Name: 차이, dtype: float64

Section 37

In [658]:
df = pd.read_csv('store_sales.csv')
df

   매장코드 요일  판매수량    단가
0     A  월    10  2000
1     A  화    15  1500
2     A  토    28  3332
3     B  월     5  2500
4     B  금     8  2200
5     B  일    17  2999
6     C  수    20  1800
7     C  목    25  1600
8     C  토    42  3554
9     C  일    49  3443
10    D  월    18  2100
11    D  토    31  3221
12    D  일    33  3110
13    E  화    10  1700
14    E  금    14  1900
15    E  토    32  2990
16    E  일    31  3276

In [ ]:
df['매출액'] = df['판매수량'] * df['단가']
map = {"월":0, "화":0, "수":0,"목":0,"금":0, "토":1,"일":1}
df['요일'] = df['요일'].replace(map)
df
weekday = df[df['요일']==0]['매출액'].sum()
weekend = df[df['요일']==1]['매출액'].sum()

   매장코드  요일  판매수량    단가     매출액
0     A   0    10  2000   20000
1     A   0    15  1500   22500
2     A   1    28  3332   93296
3     B   0     5  2500   12500
4     B   0     8  2200   17600
5     B   1    17  2999   50983
6     C   0    20  1800   36000
7     C   0    25  1600   40000
8     C   1    42  3554  149268
9     C   1    49  3443  168707
10    D   0    18  2100   37800
11    D   1    31  3221   99851
12    D   1    33  3110  102630
13    E   0    10  1700   17000
14    E   0    14  1900   26600
15    E   1    32  2990   95680
16    E   1    31  3276  101556

In [685]:
df2 = df.groupby(['매장코드','요일'])['매출액'].sum()
df2

매장코드  요일
A     0      42500
      1      93296
B     0      30100
      1      50983
C     0      76000
      1     317975
D     0      37800
      1     202481
E     0      43600
      1     197236
Name: 매출액, dtype: int64

In [687]:
df3 = df2.unstack()

In [691]:
df3

요일        0       1
매장코드
A     42500   93296
B     30100   50983
C     76000  317975
D     37800  202481
E     43600  197236

In [695]:
sub = df3[1] - df3[0] 
sub.sort_values(ascending=False)

매장코드
C    241975
D    164681
E    153636
A     50796
B     20883
dtype: int64

Section 38

In [696]:
df = pd.read_csv('region_sales.csv')
df.head()

         Date Region Product  Channel  Sales
0  2025-01-05  North       A   Online    120
1  2025-01-07  South       A  Offline    150
2  2025-02-10  North       B   Online    200
3  2023-02-12  North       A   Online    130
4  2025-03-15   East       A  Offline    100

In [710]:
df2 = pd.pivot_table(df, index=['Region','Channel'], columns="Product", values='Sales', aggfunc='sum')

In [712]:
df2.reset_index()

Product Region  Channel    A    B
0         East  Offline  100  105
1         East   Online  205  210
2        North  Offline  140  180
3        North   Online  440  420
4        South  Offline  150  145
5        South   Online  160  170
6         West  Offline  110  115
7         West   Online  135  130

In [715]:
df2['비율'] = df2['A']/(df2['A']+df2['B'])
df2.nlargest(1, "비율")

Product           A    B        비율
Region Channel
North  Online   440  420  0.511628

Section 39

In [726]:
df = pd.read_csv('monthly_sales.csv')
df.head()

df2 = df.melt(id_vars='Region', value_vars=['Jan','Feb',"Mar"], var_name='Month', value_name='Sales')
df3 = df2.groupby(['Region',"Month"])['Sales'].sum().reset_index()
len(df3[df3['Sales']>1400])

6